import { useParams } from "react-router-dom";
import { Link } from "react-router-dom";
import styles from "./Course.module.css";
import { useState, useEffect } from "react";
import Form from "./Form";
import { TfiBackRight } from "react-icons/tfi";

const courses = [
  {
    id: 1,
    title: "آموزش زبان انگلیسی خردسالان",
    desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
  },
  {
    id: 2,
    title: "آموزش زبان انگلیسی کودکان",
    desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
  },
  {
    id: 3,
    title: "آموزش زبان انگلیسی نوجوانان و جوانان",
    desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
  },
  {
    id: 4,
    title: "آموزش زبان انگلیسی بزرگسالان",
    desc: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.",
  },
];

const Course = (props) => {
  const params = useParams();

  const [course, setCourse] = useState({});
  const [isShow, setIsShow] = useState(false);
  useEffect(() => {
    const findedCourse = courses.find((c) => c.id === parseInt(params.id));
    setCourse(findedCourse);
  }, []);

  return (
    <div className={`${styles.container} ${isShow && styles.isShow}`}>
      <div className={styles.info}>
        <h2>{course.title}</h2>
        <p>{course.desc}</p>
      </div>
      <button className={styles.btn} onClick={() => setIsShow(true)}>
        ثبت نام
      </button>
      {isShow && <Form id={course.id} setIsShow={setIsShow} />}
      {/* <Link to="/courses" className={styles.link}>
        <TfiBackRight />
      </Link> */}
    </div>
  );
};

export default Course;
